Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: PELAWAK, YA?
en: is he a comedian or something?

source: DUKUN ABAL-ABAL
en: he means business.

source: JADI GIMANA?
en: so, how’s everything?

source: TIDAK ADA LAGI
en: that phone

source: SEPERTI INI SANGAT
en: of incident

source: AKU TAHU
en: if

source: DASAR ADIK
en: damn you,

source: KALIAN PADA NGAPAIN SIH?!
en: what are you guys doing?

source: HARUS DIAPAIN
en: what are we gonna do

source: OHO??
en: whoa!

source: BERUBAH PIKIRAN!!
en: my wrath!

source: APAAN?
en: what,

source: ADALAH ORANG-ORANG-
en: people too,

source: DUK!
en: thud

source: MENGALIHKAN
en: to change

source: BERBEDA
en: come up.

source: TUNGGU
en: the door

source: NAIK-NAIK KE PUNCAK GUNUNG (4)
en: let’s climb to the mountain top (4)

source: RUMAHMU INI..
en: hmm...

source: BANYAK WAKTU, JADI
en: much time, so

source: NGGAK PANAS?!
en: isn’t it too hot to wear?

source: SEBEGITU
en: that

source: GLODAK!
en: thud

source: Mon maap ni, pak..
en: unfortunately...

source: BISA SAYA BANTING,
en: want-?

source: TUNGGU..
en: wait,

source: DRRAA
en: rumble

source: TAPI
en: I don’t know

source: Kurasa gapapa?
en: I guess...

source: …TIDAK
en: no

source: ANAK INI SELAMAT, TANPA LECET SEDIKIT-PUN!!
en: the girl is safe and unharmed!

source: PAK PUR, BER-
en: hang in there,

source: SIMBAHMU?
en: will you?!

source: HANYA KECELAKAAN..
en: was simply an accident.

source: (AKU SEMPAT MENCARI RUMAH BARU, TAPI ADA SAJA MANUSIA YANG MENG-GANGGU DAN MERUSAK RUMAH BARUKU!)
en: (I tried to find a new home, but whenever I did, humans would come and mess it up.)

source: CEROBOH..
en: should come first.

source: GHOIB..
en: beings...

source: MAAF, MBAK..
en: sorry,

source: SI…
en: wh-

source: BOSS KALAU AKU
en: has told me

source: ITU BAHAYA
en: that was

source: HIKS
en: sob

source: BENAR KAN, BOWO?
en: hey, bowo,

source: AKHIRNYA
en: phew...

source: SAYA BAHKAN
en: I haven’t

source: LHO,
en: huh?

source: GRUDUK!
en: thud

source: SAJA NANTI!!
en: see!

source: TERIMA KASIH, BU..
en: thank you.

source: DIVAKSIN??
en: to get vaccinated!

source: UGHHH..!!!
en: ugh!!!

source: LAMA BERADA DI SINI,
en: for too long,

source: AIR KEMBANG
en: he’s using holy water

source: SAMPAI BELA-BELAIN
en: I’d never expected

source: APA?!
en: what?!

source: TERUS, BISA-BISA
en: rate,

source: CAMPING GROUND 3
en: CAMPGROUND 3

source: DRRRRR!
en: bzzt

source: Sudah beres, kan?
en: everything’s going as planned?

source: DIA HANYA MONYET!!!!
en: it’s just a monkey!

source: MELAKUKAN KEGIATAN
en: asked for his permission

source: HADEH..
en: huff...

source: LIHAT, MAH!
en: look, mom!

source: NYA GIMANA?
en: ghosts there?

source: Tapi kamu tidak apa-apa, kan?
en: are you okay?

source: SAYA TIDAK BISA
en: be able to work

source: A-AKU MERASA-
en: I’m sensing

source: BURUAN NIKAH
en: for you

source: MENCELAKAINYA
en: someone

source: …ITU SEMUA
en: was I

source: HEI..!!
en: hey!

source: SINI?
en: here?

source: Honeymoon bisa dimana saja!!!!
en: and have your honeymoon somewhere else!

source: SEMUA KEJANGGALAN
en: these

source: LAMBAT!!
en: to you!

source: NAMUN APABILA
en: if you

source: ULAR SUNGGUHAN!!
en: on my face!

source: JADI KORBAN
en: to suffer

source: BEBERAPA
en: I met him

source: TAPI MBAH TIRTA INGIN
en: but tirta

source: DIA TELAH ME-
en: done it

source: DUAKK!!
en: pow

source: BATS
en: dash

source: HANYA MAMPIR
en: I need to

source: TRESNO, BENAR?
en: tresno’s body, right?

source: HARUS NAIK POHON APA?!
en: should I climb a tree?!

source: TENTU SAJA HARUS
en: you have to

source: CRASHH!
en: crash

source: LAHAN INI MILIK
en: as if they own

source: SENDIRI, YA..
en: on his behalf.

source: UANG SEBANYAK INI..
en: by such large sums of money.

source: TIBA-TIBA UDAH
en: that’s

source: Telah menyelamatkan kami!!!
en: saved our lives!

source: SEBAIKNYA
en: I want you

source: SEGALA GANGGUAN YANG
en: these disturbances were so bizarre

source: MAU KE MANA KAMU?
en: where are you taking us?

source: GAAHHHH!!!
en: gaaahhh!

source: KAU PIKIR
en: did you

source: HARI INI SUDAH
en: the day’s over,

source: SAAT KEMUDIAN,
en: after,

source: HADEHHH..
en: huff...

source: APAAN?!
en: the...?!

source: OH TIDAK..
en: oh no...

source: DASAR..
en: damn vermin...

source: NANTI SAYA AKAN MINTA TIM LAIN UNTUK MEMERIKSA DAERAH SITU--ACK!!
en: I’ll ask the other group to check that area.

source: TELAH MENGUNDANG
en: I’ve invited

source: ANAK ILANG
en: missing child

source: TIDUR SAJA SEPERTI ANJAS, KAK,, NANTI BANGUN-BANGUN SUDAH SAMPAI, DEH!
en: why can’t you fall asleep like your brother? we’ll be there when you get up, okay?!

source: *LOMPAT*
en: *hop*

source: YANG BERUBAH WUJUD
en: who transforms themselves

source: MUNGKIN SALAH!
en: turned on!

source: YANG TADI ITU HANYA
en: were only meant

source: SAMA SEKALI NGGAK
en: at

source: MEONGGG!
en: meow

source: JELAS-JELAS AKU
en: I was

source: ANJRIT..
en: hey...

source: MASIH BARU
en: we’ve just

source: MINNIE!
en: sarimin!

source: AYAH TIDAK LAGI MENYAYANGIKU..
en: he doesn’t love me anymore.

source: BELUM ADA,
en: no, I don’t.

source: BERARTI APA YANG DOI TUNGGU SUDAH TIBA..
en: it means that what he’s been waiting for has finally come.

source: LAH..
en: open...

source: SATU KAKI..
en: and a leg...

source: AKHIR DARI
en: the end of

source: SETIAP PUKULAN-
en: of

source: GEMPA BUMI
en: an

source: SEGERA BERTINDAK
en: to do something

source: SALAH, YA?
en: wrong, huh?

source: AYAH MEMANG PALING BISA DIANDALKAN!
en: I can always count on you, honey!

source: OKEE, TERIMA KASIH, PAK!!
en: will do. thank you, sir!

source: TERASA SANGAT
en: to feel lighter and lighter,

source: KOK UDAH
en: you’re

source: E-EH MAKSUD
en: can I help you,

source: SUDAH KUBILANG
en: I told you,

source: MEMANG SEHARUSNYA DI SAAT-SAAT BEGINI NGGAK BISA KUTINGGAL..
en: I shouldn’t leave it behind in times like this!

source: DEG
en: thump

source: Justru karena kamu daritadi cuma baca komik doang, nggak kerja!!!
en: you’re not here to read comics all day! you’re here to work!

source: Tuan?
en: sir?

source: MBAK-MBAK ITU JELAS
en: she’s obviously

source: PARKIR MOBIL
en: PARKING LOT

source: YANG LAIN KALAU
en: the other

source: UH...
en: um...

source: MAAF, PAK..
en: sorry, sir...

source: MBAH??
en: he’s still young,

source: NGANTER KAMU
en: to take

source: DENGAN SATU
en: with a snap

source: KAMU LAGI
en: been trying to summon

source: MBAH?
en: the matter?

source: AARGHH!!
en: arghhh!!!

source: MEREKA
en: to threaten them in their dreams.

source: SEPERTINYA ANAK-ANAK NGGAK ADA YANG IKUT DENGERIN, TUH...
en: well, it looks like the kids aren’t interested.

source: YANG BERADA DI
en: in this place

source: SUDAH DIURUS OLEH
en: already taken care

source: ..KUPIKIR KAMU
en: I thought

source: ..AH!
en: oh?!

source: TRESNO MENOLAK
en: family refused

source: MANA PULES BANGET
en: you were sleeping

source: ALAT KESELAMATAN
en: their safety

source: LIHAT SENDIRI,
en: for

source: Maafkan aku...
en: forgive me...

source: SEBELAH SANA!!
en: over there!

source: UDAH SEHAT, KAN?!
en: you’re fine now, aren’t you?

source: DENGAN BAIK
en: well.

source: NYA, PUR?
en: more?

source: LEGENDA PENUNGGU
en: white monkey jinn

source: Selamat siang menjelang sore wahai pengendara yang budiman!
en: I hope you’re having a wonderful pre-dinnertime, my good citizens!

source: DENGARKAN SARANKU
en: what I said, this whole ordeal

source: AH, TERNYATA
en: oh,

source: Hmhmhmhhmhh..
en: hmm...

source: A NICE DAY!
en: day!

source: MAAF ANDA
en: PLEASE

source: MASIH UTUH DUA-
en: your kidneys, huh?

source: LAH…
en: here...

source: NA..
en: wh-

source: TUMBAL MANUSIA..!!
en: to bring him a human sacrifice!

source: ASADSFD--
en: arghhh--

source: OAA!!
en: (redacted)

source: LUAPAN ENERGI
en: the negative energy

source: URUSAN ORANG..!!
en: okay?!

source: SAYA KASIH TAHU, YA..
en: let me tell you this...

source: YA SUDAHLAH
en: oh, well...

source: HEI, JANGAN MALAH
en: don’t try

source: AKU TIDAK
en: I didn’t know

source: TU..
en: one...

source: Dia hampir saja menerkamku!
en: it was about to lunge at me!

source: MAKANYA
en: see?!

source: *MUNDUR PERLAHAN*
en: back away slowly

source: TERLUKA DI LOKASI KIAN
en: were quite

source: ENDUS
en: sniff

source: KITA HARUS BER-
en: we need to

source: DEG..!!
en: thump

source: CAPEK, NIH…
en: already exhausted...

source: ANDA INI MASIH MUDA..
en: still young.

source: PAK SUNARYO?!?!
en: daughter!

source: HARUSNYA
en: if

source: UM…
en: give me a minute!

source: KAN?
en: around.

source: OIYA, ANU, BISA
en: oh, umm...

source: UNTUK MENCARI IN-
en: to gather

source: JEDUG
en: beat

source: YANG KULIHAT
en: that

source: SALAH SEORANG
en: a very reliable

source: ..KAU SENDIRI
en: how about you?

source: MBAH
en: mr.

source: SAAT ITU
en: at that time,

source: EH, KABAR BURUK..
en: a bad news.

source: Yah, sayang sekali...
en: ah, too bad...

source: TANGAN SI MAS
en: started

source: MENGAKHIRI HUBUNGAN
en: our forbidden

source: BANGUN..
en: wake up...

source: DUKUN SATUNYA ITU,
en: of the white

source: AYAH PASTI KESAL KARENA HARUS IKUT MERA-YAAKAN ULANG-TAHUNKU..
en: he must have hated having to celebrate my birthday.

source: HEHEHE
en: hahaha

source: LENGKAPAN KALIAN!
en: and make sure they’re in order!

source: SEKALI…
en: way to go...

source: DENGANKU SUDAH TIDAK
en: with me

source: PERBUATAN
en: your days

source: KIK...
en: eek...

source: MENGIKUTINYA SANGATLAH
en: one of the most peculiar dreams

source: TAN
en: step

source: Aku tidak menyangka harga dirimu ikut trampas bersama daerah kekuasaanmu
en: I’m shocked that your sense of self-worth was taken away along with your territory.

source: ..SEMUANYA
en: just focus

source: APA YANG MEREKA
en: to get his hands dirty

source: YANG MAU CERITA
en: who wants to

source: TI..
en: no...

source: PUNG DI DUNIA
en: for almost

source: DITARUH DI BAWAH POHON
en: the offering beneath his

source: TO..
en: p-

source: KIKK..
en: eek...

source: KORBAN JIWA LAGI
en: the same fate

source: ULAR JEJADIAN INI..!!
en: this white snake!

source: DULUAN SAJA,
en: you can go on ahead without me,

source: Nah, gimana?
en: right there...

source: Su..
en: oh...

source: ..JAWABLAH
en: answer my question

source: Aku harus segera bergegas!
en: something isn’t right!

source: ..MULAI DARI
en: after this,

source: APA MAKSUDMU?
en: what do you mean?

source: SAYA, BANTU…
en: sir?

source: DENGANNYA MESKI
en: but

source: KALIAN PALING PAHAM
en: should be familiar

source: PEKERJAAN INI!!
en: my job!

source: ABANG..
en: big bro...

source: I..
en: wh-

source: CAPEK, KATANYA..
en: saying needed to rest.

source: SEDIKITPUN KOMPEN-
en: any compensation,

source: ..LAGIPULA
en: besides,

source: SAYA PASTI IZIN
en: of course!

source: KYAAAHH,
en: whoa!

source: YANG JELAS…
en: reason.

source: M-MENARIK?!
en: i-intrigued?!

source: KUNCI MOBIL SUDAH?!!?
en: have you got the car key?!

source: PULANG..?
en: day?

source: ..PISANG
en: of

source: INSIDEN INI
en: incidents.

source: EH???
en: huh?!

source: Tapi tidak ada gunanya mengedukasi kalian, yaudah aku minta maaf, deh..
en: but there’s no point in trying to teach you old guys. so, I’ll just apologize.

source: AKU TERCEKI--K!!
en: I can’t breath!!!

source: KE AYAHMU, YA..
en: to your father.

source: SESEORANG TELAH
en: I’m sure

source: HUH?
en: hmm?

source: SATU LAGI..
en: One more thing...

source: TAPI SEKARANG SUDAH
en: but look

source: SET!
en: rustle

source: EMANGNYA
en: who do you

source: NUKANG LAGI…
en: without it...

source: MONYET KURANG AJAR!!
en: you darn monkey!

source: INI YANG
en: I suppose

source: TA
en: pow

source: UDAHAN BASA-
en: let’s get

source: KERTAS MENGGUNAKAN
en: using the doll

source: LHO, TUNGGU..
en: w-wait...

source: KEMARIN RANKING 1
en: ranked first

source: HARIANKU, KAN?
en: from my diary, right?

source: Kyah!!
en: huh?!

source: SIAPA KALIAN SEBENERNYA?!
en: who are you people?!

source: DI SINI ADA
en: a legendary

source: KEMBALI TERJADI
en: keep happening.

source: KALAU PACARMU ITU
en: that your boyfriend

source: TANGANMU, IKUTI
en: your grip a little bit,

source: RESEK-MU ITU, HUBUNGI
en: give me

source: KOK GA..
en: he’s...

source: AKAN BERUBAH
en: I’ll be

source: JEPRET!
en: click

source: Senamnya nggak jadi?
en: aren’t you supposed to be at aerobics class?

source: TINGGI..
en: so high,

source: Tenang saja..
en: don’t worry...

source: JANGAN BANYAK
en: don’t

source: KURANG AJAR!!
en: how dare you!

source: Ini..
en: this...

source: KENAPA
en: why are

source: WASA!!
en: spirit!

source: KAK NAT!
en: nat!

source: Lakukan sesukamu saja..
en: do whatever you want.

source: MENGABAIKAN HAL
en: doing

source: PRIA BERNAMA
en: about

source: Apakah anda benar benar akan pergi dari sini?!
en: are you really leaving?

source: Aku butuh meminjamkan kekuatanmu untuk pergi ke tempat orang itu, Sima..
en: so, please lend me your power so I can go to that person’s place.

source: SUDAH JELAS,
en: don’t you

source: BAIK,
en: sir,

source: BAGAIMANA, MBAH SURO?
en: how is it, master suro?

source: SANG DETEKTIF (7)
en: the detective (7)

source: KAN SESUATU!!
en: write something!

source: KAU TIDAK SUKA
en: you don’t like

source: BERANI BERBUAT
en: to deal with

source: GROKK
en: oink

source: ARGHH!!
en: argh!

source: TERKEDJOET?
en: surprised?

source: JANGAN LARI-LARI!!!
en: stop running!

source: KAU MEMILIKI SESUATU YANG KUBUTUH-KAN..
en: you possess what I am seeking.

source: Percuma saja..
en: shout as loud as you want.

source: semuanya sudah kupersiapkan dengan matang
en: I’ve done my best to prepare for this.

source: JENG!
en: dun

source: SEBENTAR…
en: um...

source: Inikah yang namanya..
en: is this what they call

source: KAMU PASTI AKAN
en: sooner or later,

source: KENAPA?
en: what?

source: PADAKU..
en: my permission.

source: SAMA KAMI..
en: with us...

source: NAMANYA
en: his name is

source: JAWAB TERHADAPMU
en: and responsible.

source: APA-APAAN
en: what does

source: DIMANAA?!
en: are you?!

source: ITU TERJADI, TENTU
en: no need to sugarcoat it

source: MAKHLUK PALING
en: is the most powerful

source: KARENA ITULAH AKU
en: which is why

source: SUDAH BERADA
en: is here

source: ADA YANG HARUS
en: but some workers

source: KOTA DI SEBELAH
en: cause

source: PEDULI..
en: care.

source: DEMI KELUARGAKU..
en: ...to make my family happy.

source: HAAHHH?!!
en: what?!

source: Bercanda..
en: I was just kidding.

source: PE… PELET?!
en: a curse?

source: DEH!
en: up!

source: 20 TAHUN BERKECIM-
en: a shaman

source: AKU TIDAK DIBERI
en: I haven’t got

source: UGH, SIAL..
en: ugh, crap...

source: BAGAIMANA KALAU TERNYATA PUTRIKU LEWAT SINI!?
en: what if my daughter took this route?!

source: NYA YA, MAS?
en: as I thought.

source: SUDAH TERJEBAK!!
en: I’m trapped now!

source: SETELAH
en: after

source: Lalu, tingkat kematian akibat kecekalaan lalu lintas per 100 ribu penduduk adalah sekitar 12, cukup tinggi jika dibandingkan dengan negara tetangga seperti Singapura dan--
en: also, the death toll from traffic accidents per 100,000 people is about 12, which is quite high compared to nearby countries like singapore and--

source: NIINOO,
en: wee woo

source: SE..
en: o-

source: ACK!
en: uh... sir?

source: DRRR!!
en: bzzt

source: PAK, KEMARIN KITA SUDAH PESAN PAKET YANG MENYE-DIAKAN TENDA, KAN?
en: sir, the camping package we purchased the other day includes a tent, right?

source: Tidak ada yang perlu kamu jelaskan..
en: no need to explain.

source: TA..
en: b-

source: Bisa dibilang semua ini salahku, sih..
en: of course, this is all my fault.

source: ..TAPI SARIMIN
en: but there’s still

source: Aku tinggal membereskan beberapa barang di tenda..
en: I just need to pack up a few things from the tent, and we’ll be ready to go.

source: DEK RATNA!!
en: ratna!

source: Macan itu sangat menakutkan!
en: it was so scary!

source: KAU HANYA
en: if you keep moving,

source: JIN TERSEBUT
en: wouldn’t have been pretty.

source: TANPA MINTA IZIN
en: to ask for

source: CEPAT LARI DARI SINI, MUNKI!!
en: run for your life, munki!

source: AYOK FOTOIN, DONG!
en: take a picture of us!

source: GYAAAH!!
en: uwaaa!!!

source: ..TAPI ASAL
en: but

source: KAU DI SINI APA NGGAK
en: why don’t you

source: TAKUT UNTUK ME-
en: too hesitant

source: JAM..
en: to get here.

source: BERUBAH, DIT..
en: adit.

source: GANTENG..)
en: so handsome!)

source: DUH,
en: darn

source: AMBIL BAJU
en: change

source: ..SAYA JUGA
en: I need

source: KIKKK KIKKK!!!!
en: eek eekkk!!!

source: GOMBAL ADALAH
en: sorry,

source: SELAMA BEBERAPA
en: we looked

source: SUDAH LENGAH..
en: him.

source: GLODAK!!
en: thud

source: Kalau ini gagal, kau sudah membuang-buang banyak waktu
en: if you don’t succeed here, it’ll be a waste of time.

source: RESEK..
en: men.

source: Baru saya mau mengetuk pintu!
en: I was about to knock!

source: ..AKU?!
en: ...me?!

source: ADA YANG TIDAK BERES,
en: something wasn’t right,

source: GAGAL KUBERIKAN
en: they’ve always

source: MAH GAMPANG!!
en: anytime!

source: LAGI BELAJAR!!
en: studying at all!

source: Kavling nomor tiga!!!
en: post number three!

source: KENAPA NGGAK SAMPAI-SAMPAI KE CAMP GROUND?
en: why haven’t I gotten to the campground yet?

source: BENAR.
en: he’s right,

source: REKAN KERJA
en: are looking

source: DENGAN SEKUAT
en: me

source: BREMM!!!
en: vroom

source: PANAS BANGET..
en: so hot here...

source: KEGELAPAN DALAM
en: within you,

source: MBAH DAMAR TIDAK
en: damar didn’t tell me

source: KITA TIDAK
en: we don’t

source: Oiyak
en: oh, you’re right.

source: YANG PINDAH!!
en: yourself!

source: INGIN PULANG!!
en: wanna go home!

source: KALAU MEMANG
en: then,

source: hnngghh??
en: hmm?

source: BANYAK BENER..
en: never seen this much money before...

source: SETIAP PEKERJAAN
en: this is one of the risks

source: MAS TRESNO..
en: so much

source: CTAK
en: tud

source: AKU SUDAH KAPOK
en: I’ve

source: ditangkap / diserahkan) kepada
en: and questioned

source: ..Tinggi..
en: so high,

source: APA BOLEH BUAT,
en: I suppose it can’t be helped.

source: *MEMPROSES*
en: *Processing*

source: BAGI KELUARGA
en: the family react

source: SEBUAH
en: a

source: KUBILANG AKU
en: I’m not

source: Semoga waktu mempertemukan kita lagi!
en: may our paths intersect in the future!

source: GRATIS!!
en: in this world!

source: HMM,
en: oh?

source: GREP!
en: grab

source: AKU TURUT
en: I’m really sorry

source: RASAKAN
en: eat

source: Kami mau honeymoon di sana..
en: we’re going to spend our honeymoon there...

source: Pokoknya segera pergi dari sini!!
en: on your way at once!!!

source: DI MIMPIKU!
en: about him!

source: MIMPI ATAU
en: dreaming?

source: DUA RATUS
en: 200 thousand

source: E-EH?!
en: h-huh?!

source: TIDAK ADA GUNANYA
en: he’s not

source: ERRGGHH..
en: ugh...

source: TIDAK ADA YANG
en: death

source: TIDAK BANYAK
en: haven’t changed much,

source: Kenapa teriak-teriak, yah?
en: what’s with all the fuss?

source: Saya akan segera membawa penggantinya!
en: I’ll be right back with the replacement!

source: KZL
en: pissed

source: MUDA DAN JADI
en: so young

source: MASA KECIL HINGGA REMAJA SAYA HABISKAN BERSAMA PAMAN DAN BIBI
en: I spent most of my childhood with my uncle and aunt.

source: SR
en: slip

source: SUDAH SERAKAH,
en: he’s greedy

source: Tapi aku ingat beberapa..
en: but I remember some of them...

source: HAAH..
en: huff...

source: KEMUDIAN TELAPAK
en: his hand

source: Tapi kami tetap akan mengadakan senam rutin bersama di dalam hutan..
en: but we’ll still work out together in the forest on a regular basis.

source: DUSUN JAYA DI KAKI PEGUNUNGAN..
en: this is jaya village, located at the foot of the mountains.

source: APAAN SIH
en: what’s up

source: BERSIHAN LAHAN
en: land clearing process, you know?

source: POLISI PREMAN KURANG AJAR!!
en: do you call yourself a cop?!

source: Yah, kondisi geografisnya juga mendukung, sih..
en: well, the terrain also made it possible for you to do so.

source: TOLONG KEMBALIKAN
en: can you give me

source: ASAFSAFDS
en: argggh!

source: AKU INGIN BER-
en: I want

source: Begini cara dia balas bud--
en: what an ungrateful weasel--

source: LANTAI
en: will you be

source: HEHE
en: haha...

source: BARUSAN MUNCUL
en: dreaming

source: UWAHH!!
en: ugh!

source: DIBUANG KE SUNGAI..
en: his old cellphone?

source: AKU AKAN
en: I will

source: ..DAN JUGA
en: and

source: Hahaha, sepertinya ini ucapan selamat ulang tahun untuk Natasya dari warga desa!
en: hahaha, maybe this is how the locals celebrate natasya’s birthday!

source: SEHARUSNYA
en: you

source: BERPISAH DARI
en: he went to

source: BUKAN BEGITU, MAH!!
en: no, you don’t get it!

source: YANG DISIA-
en: it’ll be

source: DENGAN JIWA
en: wasa’s

source: UNTUK MENGEMBA-
en: to return

source: MAKANYA JANGAN LUPA SABUK PENGA-MANNYA DIPAKAI, YAAA..!!
en: that’s why you should always buckle up!

source: TAHAN DULU!!
en: hold it for a bit!

source: PERNAH KULUPAKAN
en: that you

source: AKU BERTEKAD
en: I made up my mind

source: BELUM BERAKHIR
en: it didn’t end

source: ETAK!!
en: (redacted)

source: KALAU TEMENIN BABI
en: help him

source: HMM, DARI
en: hmm,

source: KALIAN
en: you humans will

source: YANG RESE…
en: a fraud...

source: TERBUKTI, KAN?!
en: what happened!

source: Nggak ada yang sakit pas satuh tadi , kan?
en: do you hurt somewhere after falling just now?

source: KAN AKU!!!
en: and get me home!

source: MOHON MAAF KALAU
en: my bluntness, sir,

source: ..KAU MENCARI
en: looking

source: UK!!
en: (redacted)

source: AYO..
en: come on...

source: MASIH 3 HARI
en: is in three days.

source: BANGUN?
en: finally awake.

source: SEPERTINYA BUKAN
en: the lease

source: DAN BERTEMU DENGAN
en: and send my condolences

source: TERJADI..?!
en: is going on?!

source: JANGAN….!!!
en: what I think it is?!

source: SOPIRNYA..!?
en: the driver?!

source: S-SUNGGUH?
en: are you serious?

source: WAYANGNYA!!
en: summer child!

source: MEREPOTKAN
en: what

source: NGGAK TAHU DIRI..
en: dirty animals...

source: TAPI HARGA YANG
en: however,

source: RAME-RAME..?
en: on here?

source: DAN DIMULAI CAMPING YANG NAMPAKNYA AKAN BERJALAN DENGAN LANCAR..
en: so, the seemingly normal camping trip has begun...

source: INI PASTI BAGIAN DARI RENCANA TUAN SIMA!!
en: it had to be a part of his plan, right?!

source: APA KALIAN KIRA
en: do you really

source: SEBELAH SINI, YAH..
en: over here!

source: ..TIDAK
en: I shouldn’t

source: KUAT!!
en: in the whole universe!

source: BRU
en: thud

source: MANUSIA
en: clothing.

source: JRENG!!
en: dun

source: AWALNYA AKU
en: I thought

source: HHAA…
en: ugh...

source: MAU KAU SAMPAIKAN,
en: have anything

source: DARI TEMPAT ITU
en: monkey jinn

source: JANGAN MARAH (3)
en: don’t be mad (3)

source: DIA BEKERJA
en: he worked

source: Tapi karena aku pintar, aku punya beberapa klien yang tidak terdaftar secara resmi..
en: due to my foresight, however, I have a few clients who aren’t officially registered.

source: Dan yang terpenting, aku tidak mau bernasib sama sepertimu!!!
en: and most importantly, I don’t want to end up like you!!!

source: DIH,
en: eww,

source: AKU KEMBALI?!
en: get back to my own world!

source: SAMPAH KULIT
en: a banana

source: CKLAK
en: clack

source: DONG, MBAH..
en: me nervous, master.

source: Apa-apaan..
en: are you serious?

source: NYA PENGECUT, DIA
en: a wuss!

source: AKTIF?!
en: his cellphone?

source: ITU HANYA KARENA
en: just because he fell

source: TAPI MALAH RESIGN?
en: he took the easy way out, huh?

source: BISA DIHINDARI
en: prevent them.

source: Jangan salah paham, suamimu ini yang mulai!!
en: please don’t get any weird ideas, your husband started it!

source: YAH..
en: well...

source: NGELINDUR GARA-
en: sleepwalking

source: SEBELUMNYA
en: before.

source: SUDAH MEMBACA
en: you’ve read
